Revit 2024 API
MEPSection.IsMain Method
 Check whether the type of fitting in this section is main.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsMain(
	ElementId fittingId
)
Visual Basic
Public Function IsMain ( _
	fittingId As ElementId _
) As Boolean
Visual C++
public:
bool IsMain(
	ElementId^ fittingId
)
Parameters
fittingId
Type: Autodesk.Revit.DB.ElementId
 The element id which can be duct fitting and pipe fitting.
Return Value
 True if the type of fitting in this section is main False if the type of fitting in this section is branch
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The ElementId fittingId does not correspond to a valid section fitting member.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace